<a href="https://colab.research.google.com/github/luisbezerra1/Data-Science-/blob/master/Sele%C3%A7%C3%A3o_e_Frequencias.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

**Relatório de Análise IV**

In [0]:
dados = pd.read_csv('aluguel.csv', sep=';')

In [3]:
dados.head(10)

                      Tipo           Bairro  ...  Condominio    IPTU
0                Quitinete       Copacabana  ...       500.0    60.0
1                     Casa  Jardim Botânico  ...         NaN     NaN
2  Conjunto Comercial/Sala  Barra da Tijuca  ...      4020.0  1111.0
3              Apartamento           Centro  ...       390.0    20.0
4              Apartamento     Higienópolis  ...       230.0     NaN
5              Apartamento     Vista Alegre  ...         NaN     NaN
6              Apartamento         Cachambi  ...       301.0    17.0
7       Casa de Condomínio  Barra da Tijuca  ...         NaN     NaN
8       Casa de Condomínio            Ramos  ...         NaN     NaN
9  Conjunto Comercial/Sala           Centro  ...     19193.0  3030.0

[10 rows x 9 columns]

Selecionar imoveis Tipo Apartamento

In [6]:
selecao = dados.Tipo == 'Apartamento'
selecao
n1 = dados[selecao].shape[0]
n1

19532

In [16]:
selecao = (dados['Tipo'] == 'Casa')|(dados['Tipo'] == 'Casa de Condomínio')|(dados['Tipo'] == 'Casa de Vila')
n2 = dados[selecao].shape[0]
n2

2212